kModifyActionAssocEvaluationMode
The action evaluation mode in which the action is modified so that it
satisfies the objects the action depends on. The objects are not
modified, the internal data in the action or its dependencies are. An
example is an AcDbAssoc2dConstraintGroup action that may remove the
constraints that are not satisfied by the current geometry configuration.
If this cannot be achieved, the action needs to report an error and
set its status to kFailedToEvaluateAssocStatus or possibly to
kErasedAssocStatus (if it wants itself to be erased.)